#Вам надано два масиви цілих чисел nums1 і nums2, відсортовані в порядку неубування, і два цілих числа m і n, що представляють кількість елементів у nums1 і nums2 відповідно

#Об’єднайте nums1 і nums2 в один масив, відсортований у порядку неспадання.

#Остаточний відсортований масив не повинен повертатися функцією, а замість цього зберігатися в масиві nums1. Для цього nums1 має довжину m + n, де перші m елементів позначають 
#елементи, які слід об’єднати, а останні n елементів мають значення 0 і їх слід ігнорувати. nums2 має довжину n.

def merge(nums1, m, nums2, n):
    i = m - 1
    j = n - 1
    k = m + n - 1

    while i >= 0 and j >= 0:
        if nums1[i] > nums2[j]:
            nums1[k] = nums1[i]
            i -= 1
        else:
            nums1[k] = nums2[j]
            j -= 1
        k -= 1

    while j >= 0:
        nums1[k] = nums2[j]
        j -= 1
        k -= 1

nums1_1 = [1, 2, 3, 0, 0, 0]
m1 = 3
nums2_1 = [2, 5, 6]
n1 = 3

merge(nums1_1, m1, nums2_1, n1)
print(nums1_1)

nums1_2 = [1]
m2 = 1
nums2_2 = []
n2 = 0

merge(nums1_2, m2, nums2_2, n2)
print(nums1_2)

nums1_3 = [0]
m3 = 0
nums2_3 = [1]
n3 = 1

merge(nums1_3, m3, nums2_3, n3)
print(nums1_3)
